init.org
#+TITLE: Emacs Org Init File
#+AUTHOR: Jason Vander Woude

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="init.css" />

* Path Setup 

** Lisp
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/lisp/")
#+END_SRC

** Themes
Add all subdirectories of ~/.emacs.d/themes/ to the custom-theme-load-path
#+BEGIN_SRC emacs-lisp
  (let ((basedir "~/.emacs.d/themes/"))
        (dolist (f (directory-files basedir))
          (if (and (not (or (equal f ".") (equal f "..")))
                   (file-directory-p (concat basedir f)))
              (add-to-list 'custom-theme-load-path (concat basedir f)))))
#+END_SRC

* My Functions

** Return Key Functionality
Define some functions to allow for using the return key in a non-tratitional way
#+BEGIN_SRC emacs-lisp
  (defun my:return ()
    "Call the default bound to RET function. This is intended to be
    used only within the my-keys-minor-mode, othewise this is a
    useless function."
    (interactive)
    (my-keys-minor-mode 0)
    ;; interactively call the function bound to the return key
    (call-interactively (key-binding (kbd "RET") t))
    (my-keys-minor-mode 1))

  (defun my:drop-to-new-line ()
    "Move to end of line then call default bound RET function"
    (interactive)
    (move-end-of-line 1)
    (my:return))

  ;; This doesn't work on the first line of a file
  (defun my:rise-to-new-line ()
    "Move to end of previous line then call default bount RET
    function"
    (interactive)
    (previous-line 1)
    (my:drop-to-new-line))
#+END_SRC

** Save Macros as Functions
#+BEGIN_SRC emacs-lisp
(defun save-macro (name)
  "save a macro. Take a name as argument
   and save the last defined macro under
   this name at the end of your .emacs"
   (interactive "SName of the macro: ")  ; ask for the name of the macro
   (kmacro-name-last-macro name)         ; use this name for the macro
   (find-file user-init-file)            ; open ~/.emacs or other user init file
   (goto-char (point-max))               ; go to the end of the .emacs
   (newline)                             ; insert a newline
   (insert-kbd-macro name)               ; copy the macro
   (newline)                             ; insert a newline
   (switch-to-buffer nil))               ; return to the initial buffer

#+END_SRC

** Transparency
#+BEGIN_SRC emacs-lisp
  (defun transparency (value)
    "Sets the transparency of the frame window. 0=transparent/100=opaque"
    (interactive "nTransparency Value 0 - 100 opaque: ")
    (set-frame-parameter (selected-frame) 'alpha value))
#+END_SRC

** Quoting
#+BEGIN_SRC emacs-lisp
  (defun my-quote-it ()
    "Quote the current string"
    (interactive)
    (forward-char)
    (backward-sexp)
    (insert "\"")
    (forward-sexp)
    (insert "\""))
#+END_SRC

** Padding
#+BEGIN_SRC emacs-lisp
  (defun my-pad (&optional n)
    (interactive "P")
    (setq i 0)
    (unless n (setq n 4))
    (setq max (current-column))
    (while (< i (- n max))
      (insert " ")
      (setq i (1+ i))))
#+END_SRC

** My Keys Minor Mode
#+BEGIN_SRC emacs-lisp
  (defvar my-keys-minor-mode-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "RET") 'my:return)                  ;; redundant
      (define-key map (kbd "C-;") 'my:drop-to-new-line)
      (define-key map (kbd "<S-return>") 'my:rise-to-new-line)
      (define-key map (kbd "C-c C-q") 'my-quote-it)
      map)
    "my-keys-minor-mode keymap.")

  (define-minor-mode my-keys-minor-mode
    "A minor mode so that my key settings override annoying major modes."
    :init-value t
    :lighter " my-keys")

  (defun my-minibuffer-setup-hook ()
    (my-keys-minor-mode 0))

  (add-hook 'minibuffer-setup-hook 'my-minibuffer-setup-hook)

  (my-keys-minor-mode 1)
#+END_SRC

** Horizontal Centering
#+BEGIN_SRC emacs-lisp
  (defun my-horizontal-recenter ()
    "make the point horizontally centered in the window"
    (interactive)
    (let ((mid (/ (window-width) 2))
          (line-len (save-excursion (end-of-line) (current-column)))
          (cur (current-column)))
      (if (< mid cur)
          (set-window-hscroll (selected-window)
                              (- cur mid)))))
#+END_SRC

** Window Number
Add a faster binding the window-number so I can use home row keys.
#+BEGIN_SRC emacs-lisp
  (defun my-window-number-select (number)
    "Faster way to select windows using home row."
    (interactive "cEnter Char: ")
    (cond ((char-equal ?j number) (setq number 1))
          ((char-equal ?k number) (setq number 2))
          ((char-equal ?l number) (setq number 3))
          ((char-equal ?\; number) (setq number 4))
          ((char-equal ?a number) (setq number 5))
          ((char-equal ?s number) (setq number 6))
          ((char-equal ?d number) (setq number 7))
          ((char-equal ?f number) (setq number 8))
          ((char-equal ?g number) (setq number 9))
          ((char-equal ?h number) (setq number 0))
          (t (setq number (string-to-number (char-to-string number)))))
    (window-number-select number))

  (global-set-key (kbd "C-x j") 'my-window-number-select)
#+END_SRC

** Project Initialization
#+BEGIN_SRC emacs-lisp
  (defun my-setup ()
    (interactive)
    (find-file "/")
    (find-file "/ssh:jsnvndrw@beaker:/home/jsnvndrw/MyWD/R-LB-Impute/LaByRInth/functions.R")
  ;;   (R)
  ;;   (delete-other-windows)
  ;;   (find-file "/ssh:jsnvndrw@beaker:/home/jsnvndrw/MyWD/R-LB-Impute/LaByRInth/functions.R")
  ;;   (call-interactively 'origami-close-all-nodes)
  ;; ;;  (sleep-for 1)
  ;; ;;  (call-interactively (key-binding (kbd "RET")))
  ;;   (split-window-horizontally)
  ;;   (other-window 1)
  ;;   (find-file "/ssh:jsnvndrw@beaker:/home/jsnvndrw/MyWD/R-LB-Impute/LaByRInth/unit_tests.R")
  ;;   (split-window-vertically)
  ;;   (other-window 1)
  ;;   (switch-to-buffer "*R*")
  ;;   (ess-change-directory "/home/jsnvndrw/MyWD/R-LB-Impute/LaByRInth/")
    
    nil)
#+END_SRC

* General Settings
#+BEGIN_SRC emacs-lisp
  ;; (load-theme `wombat)
  ;; (load-theme `adwaita)
  ;; (require 'spacemacs-theme)
  ;; (load-theme `spacemacs-dark)
  ;; (unless (package-installed-p 'spacemacs-theme) (package-install 'spacemacs-theme))
  ;; (load-theme 'spacemacs-dark t)
  ;;(menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq frame-title-format "Emacs")
  (setq inhibit-splash-screen t)
  (transparency 95)
  (setq-default show-trailing-whitespace t)
#+END_SRC
  
* Preinstalled

** Org Mode

*** Add Templates
Add an elisp template bound to /<m + TAB/
#+BEGIN_SRC emacs-lisp
;;  (add-to-list 'org-structure-template-alist
;;               '("m" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC" "<src lang=\"?\">\n\n</src>"))
#+END_SRC

*** Add Drawers
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-drawers "FUTURE")
  (add-to-list 'org-drawers "META")
#+END_SRC

*** Set Babel Languages
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))
#+END_SRC

*** Cosmetics
#+BEGIN_SRC emacs-lisp
  (setq org-hide-leading-stars nil)
  (setq org-list-allow-alphabetical t)
  (setq org-src-fontify-natively t)  ;; you want this to activate coloring in blocks
  (setq org-src-tab-acts-natively t) ;; you want this to have completion in blocks
  (setq org-hide-emphasis-markers t) ;; to hide the *,=, or / markers
  (setq org-pretty-entities t)       ;; to have \alpha, \to and others display as utf8 http://orgmode.org/manual/Special-symbols.html
#+END_SRC

