init.org
*** Theming
This has to be before requiring Org
This source is influence by [[http://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html][this orgmode.org post]] and this [[https://emacs.stackexchange.com/questions/14824/org-block-background-font-not-having-effect/14886][StackExchange post]]
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'org-block-begin-line nil :background "#555" :foreground "#000" :underline "000")
(set-face-attribute 'org-block-end-line nil :background "#555" :foreground "#000" :overline "000")
(set-face-attribute 'org-block-background nil :background "#666")

;; (defface org-block-begin-line
;;   '((t (:underline "#FFF" :foreground "#999" :background "#050505")))
;;   "Face used for the line delimiting the begin of source blocks.")
;; (defface org-block-background
;;   '((t (:background "#AAA")))
;;   "Face used for the source block background.")
;; (defface org-block-end-line
;;   '((t (:overline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF")))
;;   "Face used for the line delimiting the end of source blocks.")

;;   (require 'color)
;; 
;;   (set-face-attribute 'org-block nil :background
;;                       (color-darken-name
;;                        (face-attribute 'default :background) 3))
;; 
;;   (setq org-src-block-faces '(("emacs-lisp" (:background "#EEE2FF"))
;;                               ("python" (:background "#E5FFB8"))))

;;   (org-block-begin-line
;;     ((t (:underline "#F00" :foreground "#0F0" :background "#00F"))))
;;   (org-block-background
;;     ((t (:background "#F0F"))))
;;   (org-block-end-line
;;     ((t (:underline "#0F0" :foreground "#00F" :background "#F00"))))
#+END_SRC

*** Notetaking
This source is influenced by [[http://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/][this blogpost]] and [[http://sachachua.com/blog/2014/01/tips-learning-org-mode-emacs/][this one]]
#+BEGIN_SRC emacs-lisp
;; set "C-c o" to open "~/organizer.org"
(global-set-key (kbd "C-c o")
                (lambda () (interactive) (find-file "~/organizer.org")))
(setq org-refile-targets '((org-agenda-files . (:maxlevel . 10))))
#+END_SRC

** Highlight Line
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode 1)
  (set-face-underline 'hl-line nil)
#+END_SRC

** Ido
Ido mode improves the minibuffer when file searching
#+BEGIN_SRC emacs-lisp
  (ido-mode)
#+END_SRC

** Line Numbers
#+BEGIN_SRC emacs-lisp
  (global-linum-mode 1)
#+END_SRC

** Column Numbers
#+BEGIN_SRC emacs-lisp
  (column-number-mode)
#+END_SRC

** Parenthesis Matching
#+BEGIN_SRC emacs-lisp
  (require 'paren)
  (show-paren-mode 1)
  (set-face-background 'show-paren-match (face-background 'default))
  (set-face-inverse-video 'show-paren-match t)
#+END_SRC
   
* Installs

** Package Setup
Add Repositories
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "http://melpa.org/packages/")
               '("elpy" . "https://jorgenschaefer.github.io/packages/")
               )
  (package-initialize)
#+END_SRC

** Melpa
*** Multiple Cursors
#+BEGIN_SRC emacs-lisp
  (require 'multiple-cursors)
#+END_SRC

*** Magit
#+BEGIN_SRC emacs-lisp
  (require 'magit)
#+END_SRC

*** Auto Complete
#+BEGIN_SRC emacs-lisp
  (require 'auto-complete)
  (require 'auto-complete-config)
  (ac-config-default)
#+END_SRC

*** Ess
#+BEGIN_SRC emacs-lisp
  (require 'ess-site)
  ;; Turn on auto-fill-mode with fill-column of 80 whenever ess-mode begins
  ;; This is in accordance with the Google R style guide
  (add-hook 'ess-mode-hook (progn
                             (auto-fill-mode)
                             (setq fill-column 80)) t)
#+END_SRC

*** Tramp
#+BEGIN_SRC emacs-lisp
  (require 'tramp)
  (setq tramp-default-method "ssh")
#+END_SRC

*** Evil Numbers
#+BEGIN_SRC emacs-lisp
  (require 'evil-numbers)
#+END_SRC

*** CSV
#+BEGIN_SRC emacs-lisp
  (require 'csv-mode)
#+END_SRC

*** Icicles
#+BEGIN_SRC emacs-lisp
  (require 'icicles)
  (icy-mode 0)
#+END_SRC

*** YASnippet
#+BEGIN_SRC emacs-lisp
  (require 'yasnippet)
  (yas-global-mode 1)
#+END_SRC

*** Origami
#+BEGIN_SRC emacs-lisp
(require 'origami)
(add-to-list 'origami-parser-alist '(ess-mode . origami-c-style-parser))
(define-key origami-mode-map (kbd "C-c j") 'origami-forward-toggle-node)
(global-origami-mode 1)
#+END_SRC

*** Rainbow Delimiters
#+BEGIN_SRC emacs-lisp
  (require 'rainbow-delimiters)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'ess-mode-hook 'rainbow-delimiters-mode)
#+END_SRC

*** Rainbow Identifiers
#+BEGIN_SRC emacs-lisp
  (require 'rainbow-identifiers)
  ;; (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)
  ;; (add-hook 'ess-mode-hook 'rainbow-identifiers-mode)
#+END_SRC

*** Projectile
#+BEGIN_SRC emacs-lisp
  (require 'projectile)
  (add-hook 'prog-mode-hook 'projectile-mode)
  (add-hook 'ess-mode-hook 'projectile-mode)
#+END_SRC

*** Helm Related Stuff
**** Helm
#+BEGIN_SRC emacs-lisp
  (require 'helm)
  (require 'helm-config)
  (helm-mode 1)

  (when (executable-find "curl")
    (setq helm-google-suggest-use-curl-p t))

  (setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
        helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
        helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
        helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
        helm-ff-file-name-history-use-recentf t
        helm-echo-input-in-header-line t)

  (defun spacemacs//helm-hide-minibuffer-maybe ()
    "Hide minibuffer in Helm session if we use the header line as input field."
    (when (with-helm-buffer helm-echo-input-in-header-line)
      (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
        (overlay-put ov 'window (selected-window))
        (overlay-put ov 'face
                     (let ((bg-color (face-background 'default nil)))
                       `(:background ,bg-color :foreground ,bg-color)))
        (setq-local cursor-type nil))))


  (add-hook 'helm-minibuffer-set-up-hook
            'spacemacs//helm-hide-minibuffer-maybe)

  ;; Code from [[https://www.reddit.com/r/emacs/comments/345vtl/make_helm_window_at_the_bottom_without_using_any/][emacs reddit]]
  (add-to-list 'display-buffer-alist
               `(,(rx bos "*helm" (* not-newline) "*" eos)
                 (display-buffer-in-side-window)
                 (inhibit-same-window . t)
                 (window-height . 0.4)))

  ;; Allow helm to automatically size the buffer to fit the content
  (helm-autoresize-mode t)
  ;; Numbers are percentages but I don't understand the 0
  (setq helm-autoresize-max-height 0)
  (setq helm-autoresize-min-height 40)
#+END_SRC

**** Ace Jump Helm Line
Ace Jump Helm info at https://github.com/cute-jumper/ace-jump-helm-line
#+BEGIN_SRC emacs-lisp
  (require 'ace-jump-helm-line)
  (eval-after-load "helm"
    '(define-key helm-map (kbd "M-;") 'ace-jump-helm-line))

  ;; (ace-jump-helm-line-autoshow-mode)
  ;; (setq ace-jump-helm-line-autoshow-use-linum t)
  (setq ace-jump-helm-line-default-action 'select)
  (setq ace-jump-helm-line-select-key ?e) ;; this line is not needed
  ;; Set the move-only and persistent keys (these don't seem to work)
  (setq ace-jump-helm-line-move-only-key ?o)
  (setq ace-jump-helm-line-persistent-key ?p)
#+END_SRC

**** Helm Swoop
#+BEGIN_SRC emacs-lisp
  (require 'helm-swoop)
  (global-set-key (kbd "C-S-s") 'helm-swoop)
#+END_SRC

**** Helm Projectile
#+BEGIN_SRC emacs-lisp
  (setq helm-projectile-fuzzy-match t)
  (require 'helm-projectile)
  (helm-projectile-on)
#+END_SRC

**** Helm M-x
Use helm-M-x instead of M-x
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-x") 'helm-M-x)
  (setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
#+END_SRC

**** Helm Mini
Used for switching buffers and recent files
#+BEGIN_SRC emacs-lisp
  (setq helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match t)
#+END_SRC

*** Powerline
#+BEGIN_SRC emacs-lisp
  ;; (require 'powerline)
  ;; (powerline-default-theme)
#+END_SRC

*** Git Timemachine
#+BEGIN_SRC emacs-lisp
  (require 'git-timemachine)
#+END_SRC

** Manual

** Elpy

*** Elpy
#+BEGIN_SRC emacs-lisp
  (elpy-enable)
#+END_SRC

*** M2
#+BEGIN_SRC emacs-lisp
  (load "~/.emacs-Macaulay2" t)
  (global-set-key (kbd "C-c C-l") 'M2-send-to-program)
#+END_SRC

*** Window Number
#+BEGIN_SRC emacs-lisp
  (autoload 'window-number-mode
    "window-number.el"
    "A global minor mode that enables selection of windows
    according to numbers with the C-x C-j prefix.  Another mode,
    `window-number-meta-mode' enables the use of the M- prefix."
    t)

  (window-number-mode)
#+END_SRC

*** Ace Jump
#+BEGIN_SRC emacs-lisp
  (autoload
    'ace-jump-mode
    "ace-jump-mode"
    "Emacs quick move minor mode"
    t)
#+END_SRC

* Global Key Bindings

** Window Movement
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x <up>") 'windmove-up)
  (global-set-key (kbd "C-x <down>") 'windmove-down)
  (global-set-key (kbd "C-x <right>") 'windmove-right)
  (global-set-key (kbd "C-x <left>") 'windmove-left)
#+END_SRC
