init.el

(set-face-attribute 'org-block-begin-line nil :background "#555" :foreground "#000" :underline "000")
(set-face-attribute 'org-block-end-line nil :background "#555" :foreground "#000" :overline "000")
(set-face-attribute 'org-block-background nil :background "#666")

;; (defface org-block-begin-line
;;   '((t (:underline "#FFF" :foreground "#999" :background "#050505")))
;;   "Face used for the line delimiting the begin of source blocks.")
;; (defface org-block-background
;;   '((t (:background "#AAA")))
;;   "Face used for the source block background.")
;; (defface org-block-end-line
;;   '((t (:overline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF")))
;;   "Face used for the line delimiting the end of source blocks.")

;;   (require 'color)
;; 
;;   (set-face-attribute 'org-block nil :background
;;                       (color-darken-name
;;                        (face-attribute 'default :background) 3))
;; 
;;   (setq org-src-block-faces '(("emacs-lisp" (:background "#EEE2FF"))
;;                               ("python" (:background "#E5FFB8"))))

;;   (org-block-begin-line
;;     ((t (:underline "#F00" :foreground "#0F0" :background "#00F"))))
;;   (org-block-background
;;     ((t (:background "#F0F"))))
;;   (org-block-end-line
;;     ((t (:underline "#0F0" :foreground "#00F" :background "#F00"))))

(global-hl-line-mode 1)
(set-face-underline 'hl-line nil)

(ido-mode)

(global-linum-mode 1)

(column-number-mode)

(require 'paren)
(show-paren-mode 1)
(set-face-background 'show-paren-match (face-background 'default))
(set-face-inverse-video 'show-paren-match t)

(require 'package)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/")
             '("elpy" . "https://jorgenschaefer.github.io/packages/")
             )
(package-initialize)

(require 'multiple-cursors)

(require 'magit)

(require 'auto-complete)
(require 'auto-complete-config)
(ac-config-default)

(require 'ess-site)
;; Turn on auto-fill-mode with fill-column of 80 whenever ess-mode begins
;; This is in accordance with the Google R style guide
(add-hook 'ess-mode-hook (progn
                           (auto-fill-mode)
                           (setq fill-column 80)) t)

(require 'tramp)
(setq tramp-default-method "ssh")

(require 'evil-numbers)

(require 'csv-mode)

(require 'icicles)
(icy-mode 0)

(require 'yasnippet)
(yas-global-mode 1)

(require 'origami)
(add-to-list 'origami-parser-alist '(ess-mode . origami-c-style-parser))
(define-key origami-mode-map (kbd "C-c j") 'origami-forward-toggle-node)
(global-origami-mode 1)

(require 'rainbow-delimiters)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
(add-hook 'ess-mode-hook 'rainbow-delimiters-mode)

(require 'rainbow-identifiers)
;; (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)
;; (add-hook 'ess-mode-hook 'rainbow-identifiers-mode)

(require 'projectile)
(add-hook 'prog-mode-hook 'projectile-mode)
(add-hook 'ess-mode-hook 'projectile-mode)

(require 'helm)
(require 'helm-config)
(helm-mode 1)

(when (executable-find "curl")
  (setq helm-google-suggest-use-curl-p t))

(setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
      helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
      helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
      helm-ff-file-name-history-use-recentf t
      helm-echo-input-in-header-line t)

(defun spacemacs//helm-hide-minibuffer-maybe ()
  "Hide minibuffer in Helm session if we use the header line as input field."
  (when (with-helm-buffer helm-echo-input-in-header-line)
    (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
      (overlay-put ov 'window (selected-window))
      (overlay-put ov 'face
                   (let ((bg-color (face-background 'default nil)))
                     `(:background ,bg-color :foreground ,bg-color)))
      (setq-local cursor-type nil))))


(add-hook 'helm-minibuffer-set-up-hook
          'spacemacs//helm-hide-minibuffer-maybe)

;; Code from [[https://www.reddit.com/r/emacs/comments/345vtl/make_helm_window_at_the_bottom_without_using_any/][emacs reddit]]
(add-to-list 'display-buffer-alist
             `(,(rx bos "*helm" (* not-newline) "*" eos)
               (display-buffer-in-side-window)
               (inhibit-same-window . t)
               (window-height . 0.4)))

;; Allow helm to automatically size the buffer to fit the content
(helm-autoresize-mode t)
;; Numbers are percentages but I don't understand the 0
(setq helm-autoresize-max-height 0)
(setq helm-autoresize-min-height 40)

(require 'ace-jump-helm-line)
(eval-after-load "helm"
  '(define-key helm-map (kbd "M-;") 'ace-jump-helm-line))

;; (ace-jump-helm-line-autoshow-mode)
;; (setq ace-jump-helm-line-autoshow-use-linum t)
(setq ace-jump-helm-line-default-action 'select)
(setq ace-jump-helm-line-select-key ?e) ;; this line is not needed
;; Set the move-only and persistent keys (these don't seem to work)
(setq ace-jump-helm-line-move-only-key ?o)
(setq ace-jump-helm-line-persistent-key ?p)

(require 'helm-swoop)
(global-set-key (kbd "C-S-s") 'helm-swoop)

(setq helm-projectile-fuzzy-match t)
(require 'helm-projectile)
(helm-projectile-on)

(global-set-key (kbd "M-x") 'helm-M-x)
(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x

(setq helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match t)

;; (require 'powerline)
;; (powerline-default-theme)

(require 'git-timemachine)

(elpy-enable)

(load "~/.emacs-Macaulay2" t)
(global-set-key (kbd "C-c C-l") 'M2-send-to-program)

(autoload 'window-number-mode
  "window-number.el"
  "A global minor mode that enables selection of windows
  according to numbers with the C-x C-j prefix.  Another mode,
  `window-number-meta-mode' enables the use of the M- prefix."
  t)

(window-number-mode)

(autoload
  'ace-jump-mode
  "ace-jump-mode"
  "Emacs quick move minor mode"
  t)

(global-set-key (kbd "C-x <up>") 'windmove-up)
(global-set-key (kbd "C-x <down>") 'windmove-down)
(global-set-key (kbd "C-x <right>") 'windmove-right)
(global-set-key (kbd "C-x <left>") 'windmove-left)
