init.org
** Mutliple Cursors
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
#+END_SRC

** Magit
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC

** Ace Jump
#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "C-c C-SPC") 'ace-jump-mode)
  (define-key global-map (kbd "M-s M-j") 'ace-jump-mode)
  (define-key global-map (kbd "M-s M-d") 'ace-jump-mode)
  (define-key global-map (kbd "C-S-c C-SPC") 'ace-jump-line-mode)
#+END_SRC

** Move Backward Key Swap
#+BEGIN_SRC emacs-lisp
  ;; Swap M-b with M-j and C-b with C-j to give a more convenient
  ;; forward backward movement I'm not sure this is the best route since
  ;; there are times that I would like to use C-j as intended e.g. in
  ;; helm mode C-j is used to expand the current selection and now I'm
  ;; forced to use C-b to do so But I don't think I can just use
  ;; global-set-key to change the behavior the functions called are
  ;; context dependent

  ;; (define-key key-translation-map (kbd "C-b") (kbd "C-j"))
  ;; (define-key key-translation-map (kbd "C-j") (kbd "C-b"))

  ;; (define-key key-translation-map (kbd "M-b") (kbd "M-j"))
  ;; (define-key key-translation-map (kbd "M-j") (kbd "M-b"))
#+END_SRC

** Evil Numbers
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c +") 'evil-numbers/inc-at-pt)
  (global-set-key (kbd "C-c -") 'evil-numbers/dec-at-pt)
  (global-set-key (kbd "<kp-add>") 'evil-numbers/inc-at-pt)
  (global-set-key (kbd "<kp-subtract>") 'evil-numbers/dec-at-pt)
#+END_SRC

** Helm

Code from [[http://tuhdo.github.io/helm-intro.html]] trying to mimick spacemacs
#+BEGIN_SRC emacs-lisp
  ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
  ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
  ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
  (global-set-key (kbd "C-c h") 'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))

  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
  (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "M-x") 'helm-M-x)
  ;; (global-set-key (kbd "C-x b") 'helm-buffers-list)
  (global-set-key (kbd "C-x b") 'helm-mini)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
#+END_SRC

** Register Jump
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-z") 'jump-to-register)
  (global-set-key (kbd "C-M-z") 'window-configuration-to-register)
  (global-set-key (kbd "C-S-z") 'point-to-register)
#+END_SRC

** Origami
#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "<S-iso-lefttab>") 'origami-forward-toggle-node)
#+END_SRC

** Horizontal Centering
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-S-l") 'my-horizontal-recenter)
#+END_SRC

** Other
#+BEGIN_SRC emacs-lisp
  ;; This should be updated to allow for things such as 
  ;;   M-m f for find files
  ;;   M-m b for switch buffers
  ;; (global-set-key (kbd "M-m") (lookup-key global-map (kbd "C-x")))
  ;; (define-key key-translation-map (kbd "C-g") (kbd "M-g"))
  ;; (let ((mg (lookup-key global-map (kbd "M-g"))) (cg (lookup-key global-map (kbd "C-g"))))
  ;;   (global-set-key (kbd "M-g") cg)
  ;;   (global-set-key (kbd "C-g") mg))
#+END_SRC

* Final Calls
Starting a server allows using the emacsclient so that session info to be shared across frames
#+BEGIN_SRC emacs-lisp
  (if (and (fboundp 'server-running-p) 
           (not (server-running-p)))
      (server-start))
#+END_SRC

Load theme
#+BEGIN_SRC emacs-lisp
  ;; For some reason it doesn't work to load this with the other general settings
  (load-theme 'spacemacs-dark t)
#+END_SRC

Set up M-m keymapping
This is called near the end of the file because I want to access the functions called with other keybindings, so those need to be set up already
#+BEGIN_SRC emacs-lisp
  (defvar my-git-extras-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "T") 'git-timemachine)   ;; T for timemachine
      (define-key map (kbd "t") 'smeargle)   ;; t for time of commit
      (define-key map (kbd "a") 'smeargle-commit)    ;; a for age of commit
      (define-key map (kbd "c") 'smeargle-clear)     ;; c for clear smeargle
      map)
    "Git fancy extra commands mapping")

  (defvar my-git-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "s") 'magit-status)
      (define-key map (kbd "l") 'magit-log-all)
      (define-key map (kbd "x") my-git-extras-map)
      map)
    "Git commands mapping")

  (defvar my-rapid-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "j") (lambda() (interactive) (window-number-select 1))) ;; window 1
      (define-key map (kbd "k") (lambda() (interactive) (window-number-select 2))) ;; window 2
      (define-key map (kbd "l") (lambda() (interactive) (window-number-select 3))) ;; window 3
      (define-key map (kbd ";") (lambda() (interactive) (window-number-select 4))) ;; window 4
      (define-key map (kbd "p") (lambda() (interactive) (other-window -1)))        ;; previous window
      (define-key map (kbd "M-SPC") 'avy-goto-word-1)                              ;; ace jump
      (define-key map (kbd "SPC")   'avy-goto-word-1)                              ;; ace jump
      map)
    "Rapid commands mapping")

  (defvar my-M-m-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "p") 'helm-projectile)
      (define-key map (kbd "b") (lookup-key global-map (kbd "C-x b")))
      (define-key map (kbd "f") (lookup-key global-map (kbd "C-x C-f")))
      (define-key map (kbd "s") 'helm-swoop)
      (define-key map (kbd "SPC") (lookup-key global-map (kbd "M-x")))
      (define-key map (kbd "g") my-git-map)
      map)
    "M-m keymap.")

  (global-set-key (kbd "M-m") my-M-m-map)
  (global-set-key (kbd "M-SPC") my-rapid-map)
#+END_SRC

Load Powerline
This also had some problems loading earlier in the file
#+BEGIN_SRC emacs-lisp
  (require 'powerline)
  (powerline-default-theme)
#+END_SRC

* Not Executed

** Code Completion
This segment inspired by this [[https://www.youtube.com/watch?v%3DHTUE03LnaXA][YouTube video]]
#+BEGIN_QUOTE
;; this function doesn't seem to be working yet
(defun my:ac-c-header-init()
  ;; Run command 'gcc -xc++ -E -v -' to find location of c++ header files on system
  (require 'auto-complete-c-headers)
  (add-to-list 'ac-sources 'ac-source-c-headers)
  (setq achead:include-directories
   (append '("/usr/include/c++/5"
             "/usr/include/x86_64-linux-gnu/c++/5"
             "/usr/include/c++/5/backward"
             "/usr/lib/gcc/x86_64-linux-gnu/5/include"
             "/usr/lib/gcc/x86_64-linux-gnu/5/include-fixed"
             "/usr/include/x86_64-linux-gnu")
             achead:include-directories)))
(add-hook 'c++-mode-hook 'my:ac-c-header-init)
(add-hook 'c-mode-hook 'my:ac-c-header-init)
;; flymake-google-cpplint comes from melpa
(defun my:flymake-google-init()
  (require 'flymake-gogle-cpplint)
  ;; in order to use this run from shell 'pip install cpplint'
  (custom-set-variables
   '(flycheck-c/c++-googlelint-executable "/usr/local/bin/cpplint.py"))
;;  (custon-set-variables
;;   '(flymake-gogle-cpplint-command "./.local/lib/python2.7/site-packages/cpplint.pyc"))
  (flymake-google-cpplint-load))
(add-hook 'c++-mode-hook 'my:flymake-google-init)
(add-hook 'c-mode-hook 'my:flymake-google-init)
;; NOTE: header files and cpplint don't seem to be working
#+END_QUOTE
** Tips
- M-h (org-mark-element)
- M-= (count-words-region START END &optional ARG

* TODO
- git timemachine (and view by commit time)
- compile rainbow-delimiters
- commit to github
- add M-m stuff or maybe M-SPC stuff and shoot for spacemacs style




