init.el

(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)

(global-set-key (kbd "C-x g") 'magit-status)

(define-key global-map (kbd "C-c C-SPC") 'ace-jump-mode)
(define-key global-map (kbd "M-s M-j") 'ace-jump-mode)
(define-key global-map (kbd "M-s M-d") 'ace-jump-mode)
(define-key global-map (kbd "C-S-c C-SPC") 'ace-jump-line-mode)

;; Swap M-b with M-j and C-b with C-j to give a more convenient
;; forward backward movement I'm not sure this is the best route since
;; there are times that I would like to use C-j as intended e.g. in
;; helm mode C-j is used to expand the current selection and now I'm
;; forced to use C-b to do so But I don't think I can just use
;; global-set-key to change the behavior the functions called are
;; context dependent

;; (define-key key-translation-map (kbd "C-b") (kbd "C-j"))
;; (define-key key-translation-map (kbd "C-j") (kbd "C-b"))

;; (define-key key-translation-map (kbd "M-b") (kbd "M-j"))
;; (define-key key-translation-map (kbd "M-j") (kbd "M-b"))

(global-set-key (kbd "C-c +") 'evil-numbers/inc-at-pt)
(global-set-key (kbd "C-c -") 'evil-numbers/dec-at-pt)
(global-set-key (kbd "<kp-add>") 'evil-numbers/inc-at-pt)
(global-set-key (kbd "<kp-subtract>") 'evil-numbers/dec-at-pt)

;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))

(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
(define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
(define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "M-x") 'helm-M-x)
;; (global-set-key (kbd "C-x b") 'helm-buffers-list)
(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "M-y") 'helm-show-kill-ring)

(global-set-key (kbd "C-z") 'jump-to-register)
(global-set-key (kbd "C-M-z") 'window-configuration-to-register)
(global-set-key (kbd "C-S-z") 'point-to-register)

(define-key global-map (kbd "<S-iso-lefttab>") 'origami-forward-toggle-node)

(global-set-key (kbd "C-S-l") 'my-horizontal-recenter)

;; This should be updated to allow for things such as 
;;   M-m f for find files
;;   M-m b for switch buffers
;; (global-set-key (kbd "M-m") (lookup-key global-map (kbd "C-x")))
;; (define-key key-translation-map (kbd "C-g") (kbd "M-g"))
;; (let ((mg (lookup-key global-map (kbd "M-g"))) (cg (lookup-key global-map (kbd "C-g"))))
;;   (global-set-key (kbd "M-g") cg)
;;   (global-set-key (kbd "C-g") mg))

(if (and (fboundp 'server-running-p) 
         (not (server-running-p)))
    (server-start))

;; For some reason it doesn't work to load this with the other general settings
(load-theme 'spacemacs-dark t)

(defvar my-git-extras-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "T") 'git-timemachine)   ;; T for timemachine
    (define-key map (kbd "t") 'smeargle)   ;; t for time of commit
    (define-key map (kbd "a") 'smeargle-commit)    ;; a for age of commit
    (define-key map (kbd "c") 'smeargle-clear)     ;; c for clear smeargle
    map)
  "Git fancy extra commands mapping")

(defvar my-git-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "s") 'magit-status)
    (define-key map (kbd "l") 'magit-log-all)
    (define-key map (kbd "x") my-git-extras-map)
    map)
  "Git commands mapping")

(defvar my-rapid-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "j") (lambda() (interactive) (window-number-select 1))) ;; window 1
    (define-key map (kbd "k") (lambda() (interactive) (window-number-select 2))) ;; window 2
    (define-key map (kbd "l") (lambda() (interactive) (window-number-select 3))) ;; window 3
    (define-key map (kbd ";") (lambda() (interactive) (window-number-select 4))) ;; window 4
    (define-key map (kbd "p") (lambda() (interactive) (other-window -1)))        ;; previous window
    (define-key map (kbd "M-SPC") 'avy-goto-word-1)                              ;; ace jump
    (define-key map (kbd "SPC")   'avy-goto-word-1)                              ;; ace jump
    map)
  "Rapid commands mapping")

(defvar my-M-m-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "p") 'helm-projectile)
    (define-key map (kbd "b") (lookup-key global-map (kbd "C-x b")))
    (define-key map (kbd "f") (lookup-key global-map (kbd "C-x C-f")))
    (define-key map (kbd "s") 'helm-swoop)
    (define-key map (kbd "SPC") (lookup-key global-map (kbd "M-x")))
    (define-key map (kbd "g") my-git-map)
    map)
  "M-m keymap.")

(global-set-key (kbd "M-m") my-M-m-map)
(global-set-key (kbd "M-SPC") my-rapid-map)

(require 'powerline)
(powerline-default-theme)
